--- a/README.md
+++ b/README.md
@@ -1,10 +1,15 @@
 # BenchmarkMonitoring
  C# project for uni
 
-@startuml
-BenchmarkService -> BenchmarkService: Create Data
-BenchmarkService -> SQLite: Save to database
-BenchmarkConsole -> SQLite: Get BenchmarkData
-SQLite --> BenchmarkConsole 
-BenchmarkConsole -> BenchmarkConsole : Show data
-@enduml
+```mermaid
+sequenceDiagram
+   participant BenchmarkService
+   participant SQLite
+   participant BenchmarkConsole
+
+   BenchmarkService ->> BenchmarkService: Create Data
+   BenchmarkService ->> SQLite: Save to database
+   BenchmarkConsole ->> SQLite: Get BenchmarkData
+   SQLite -->> BenchmarkConsole: 
+   BenchmarkConsole ->> BenchmarkConsole : Show data
+```
